import logging
import time

import pytest

from src.core.combat.combat_system import CombatSystem
from src.core.combat.resonator.encore import Encore
from src.core.contexts import Context
from src.core.injector import Container
from src.core.interface import ControlService, WindowService, ImgService

logger = logging.getLogger(__name__)


@pytest.fixture(scope="module")
def context():
    logger.debug("\n")
    context = Context()
    return context


@pytest.fixture(scope="module")
def container(context):
    container = Container.build(context)
    return container


@pytest.fixture(scope="module")
def control_service(container):
    control_service: ControlService = container.control_service()
    control_service.activate()
    time.sleep(0.2)

    logger.debug("---------------------------------")

    logger.debug("大写A-Z表示键盘上的按键，小写a-z为特殊按键")
    logger.debug("小写 a 代表普通攻击，点按默认按压0.05s")
    logger.debug("小写 z 代表重击，长按默认按压0.5s")
    logger.debug("小写 w wait，代表等待，不按任何按键，常放于连段最后，用于设置可合轴的后摇时间，方便在实战中跳过切人")
    logger.debug("小写 j jump，代表跳跃，常放于连段最后，用于测试后摇是否结束，能跳出来代表后摇结束")
    logger.debug("小写 d dodge，代表闪避，常用于取消后摇")

    logger.debug('["按键", "默认按压时间", "按压后等待时间，即后摇时间，按需要动态调整"]')
    logger.debug('["A",    0.05,        0.50]')
    logger.debug('...')
    logger.debug('["Z",    0.05,        0.50]')
    logger.debug('["a",    0.05,        0.50]')
    logger.debug('["z",    0.50,        0.50]')
    logger.debug('["w",    0.00,        0.50]')
    logger.debug('["j",    0.05,        0.50]')

    logger.debug("所有连段基于：30FPS")

    logger.debug("---------------------------------")
    return control_service


def combo_action(control_service, seq, after_time, cycle=50):
    for i in range(cycle):
        for keys in seq:
            key_src, press_time, wait_time = keys[:3]
            key = key_src  # a a_down a_up
            key_action = None  # down up
            if "_" in key_src:
                key, key_action = key_src.strip().split("_", 1)
            if not key_action:
                if key == "a":
                    if press_time > 0.2:
                        raise ValueError("普攻按压时间不可大于0.2，默认统一填写0.05")
                    control_service.fight_click(seconds=press_time)
                elif key == "z":
                    if press_time < 0.3:
                        raise ValueError("重击按压时间不可小于0.3，默认统一写0.5")
                    control_service.fight_click(seconds=press_time)
                elif key == "w":
                    pass
                elif key == "j":
                    control_service.fight_tap("SPACE", press_time)
                elif key == "d":
                    # control_service.fight_tap("LSHIFT", press_time)
                    control_service.fight_right_click(seconds=press_time)
                else:
                    control_service.fight_tap(key, press_time)
            else:
                if key_action == "down":
                    if key in ["a", "z"]:
                        control_service.mouse_left_down(seconds=press_time)
                    elif key == "w":
                        pass
                    elif key == "j":
                        control_service.key_down("SPACE", press_time)
                    elif key == "d":
                        # control_service.fight_tap("LSHIFT", press_time)
                        control_service.mouse_right_down(seconds=press_time)
                    else:
                        control_service.key_down(key, press_time)
                    # key_down_caches.add(key)
                elif key_action == "up":
                    if key in ["a", "z"]:
                        control_service.mouse_left_up(seconds=press_time)
                    elif key == "w":
                        pass
                    elif key == "j":
                        control_service.key_up("SPACE", press_time)
                    elif key == "d":
                        # control_service.fight_tap("LSHIFT", press_time)
                        control_service.mouse_right_up(seconds=press_time)
                    else:
                        control_service.key_up(key, press_time)
                    # key_down_caches.discard(key)
                else:
                    logger.warning("Unknown key action '{}'".format(key_action))
            if wait_time <= 0:
                continue
            time.sleep(wait_time)
        time.sleep(after_time)


def test_combo_Jinhsi(control_service):
    # 大写A-Z表示键盘上的按键，小写a-z为特殊按键
    # 小写 a 代表普通攻击，点按默认按压0.05s
    # 小写 z 代表重击，长按默认按压0.5s
    # 小写 w wait，代表等待，不按任何按键，常放于连段最后，用于设置可合轴的后摇时间，方便在实战中跳过切人
    # 小写 j jump，代表跳跃，常放于连段最后，用于测试后摇是否结束，能跳出来代表后摇结束
    # 小写 d dodge，代表闪避，常用于取消后摇

    # ["按键", "默认按压时间", "按压后等待时间，即后摇时间，按需要动态调整"]
    # ["A",    0.05,        0.50]
    # ...
    # ["Z",    0.05,        0.50]
    # ["a",    0.05,        0.50]
    # ["z",    0.50,        0.50]
    # ["w",    0.00,        0.50]
    # ["j",    0.05,        0.50]

    # 所有连段基于：30FPS

    # 汐汐 BnB combo
    seq = [
        ["a", 0.05, 0.45],
        ["a", 0.05, 0.45],
        ["a", 0.05, 0.90],
        ["a", 0.05, 0.35],
        ["E", 0.05, 0.00],
        # 间隔
        ["w", 0.00, 0.75],  # 间隔(合轴点)需足够，否则二段开始，角色却还在一段的后摇中，会吞按键

        ["a", 0.05, 0.45],
        ["a", 0.05, 0.55],
        ["a", 0.05, 0.25],
        ["E", 0.05, 0.75],
        ["a", 0.05, 0.35],
        ["a", 0.05, 0.40],
        ["E", 0.05, 0.00],
    ]
    combo_action(control_service, seq, 7.5)


def test_combo_Jinhsi_AdvancedCombo(control_service):
    # 汐汐 速喷 BV1sUfHYdEPG
    # 4a E闪a跳 a闪a闪 aE
    seq = [
        ["a", 0.05, 0.45],
        ["a", 0.05, 0.45],
        ["a", 0.05, 0.90],
        ["a", 0.05, 0.40],

        ["E", 0.05, 0.05],
        ["d", 0.05, 0.30],
        ["a", 0.05, 0.05],
        ["j", 0.05, 0.01],

        ["W_down", 0.00, 0.00],
        ["a", 0.05, 0.05],
        ["d", 0.05, 0.30],
        ["W_up", 0.00, 0.00],
        ["a", 0.05, 0.05],
        ["d", 0.05, 0.30],

        # # 直接喷 E4
        # ["a", 0.05, 0.05],
        # ["E", 0.05, 0.00],

        # 升龙再喷 E3E4
        ["E", 0.05, 1.00],
        ["a", 0.05, 0.20],
        ["a", 0.05, 0.20],
        ["E", 0.05, 0.00],

        ["w", 0.05, 2.50],
        ["j", 0.05, 0.15],
    ]
    combo_action(control_service, seq, 10.0, cycle=2000)


def test_combo_Jinhsi_AdvancedCombo2(control_service):
    # v2.5已失效
    # 汐汐 变奏（E2下劈）速喷 BV1rS5Vz4Egy BV1dtEgzUEAF
    # E2状态 下落攻击 落地瞬间跳（翻滚） E跳 a跳a跳a跳a跳 E
    seq = [
        # 进入E2
        ["a", 0.05, 0.45],
        ["a", 0.05, 0.45],
        ["a", 0.05, 0.90],
        ["a", 0.05, 0.40],
        # 模拟下劈
        ["j", 0.05, 0.27],
        ["a", 0.05, 0.00],
    ]
    combo_action(control_service, seq, 0.0, cycle=1)
    seq = [
        ["j", 0.002, 0.005],
        ["a", 0.002, 0.005],
        ["j", 0.002, 0.005],
        ["E", 0.002, 0.005],

        # ["j", 0.002, 0.002],
        # ["a", 0.002, 0.002],
        # ["j", 0.002, 0.002],
        # ["E", 0.002, 0.002],
        # ["j", 0.002, 0.002],
        # ["a", 0.002, 0.002],
        # ["j", 0.002, 0.002],
        # ["a", 0.002, 0.002],
        # ["j", 0.002, 0.002],
        # ["a", 0.002, 0.002],
        # ["j", 0.002, 0.002],
        # ["a", 0.002, 0.002],
        # ["j", 0.002, 0.002],
        # ["a", 0.002, 0.002],
        # ["a", 0.002, 0.002],

    ]
    combo_action(control_service, seq, 0.0, cycle=50)


def test_combo_Changli(control_service):
    # 长离
    seq = [
        # 声骸技能
        ["Q", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 1.60],
        ["j", 0.05, 1.20],
        # 共鸣技能 Ea 一离火
        ["E", 0.05, 1.25],
        ["a", 0.05, 1.30],
        # ["E", 0.05, 1.25],
        # ["a", 0.05, 1.30],
        # 间隔
        ["w", 0.00, 1.20],
        # 普攻 5a 一离火
        ["a", 0.05, 0.31],
        ["a", 0.05, 0.50],
        ["a", 0.05, 0.50],
        ["a", 0.05, 1.05],
        ["a", 0.05, 0.00],
        ["w", 0.05, 0.75],
        ["j", 0.05, 1.2],
        # 共鸣技能 Ea 一离火
        ["E", 0.05, 1.25],
        ["a", 0.05, 1.30],
        ["w", 0.00, 1.20],
        # 普攻 5a 一离火
        ["a", 0.05, 0.31],
        ["a", 0.05, 0.50],
        ["a", 0.05, 0.50],
        ["a", 0.05, 1.05],
        ["a", 0.05, 0.00],
        ["w", 0.05, 0.75],
        ["j", 0.05, 1.20],
        # zRz
        ["z", 0.50, 0.90],
        ["R", 0.05, 1.65],
        ["z", 1.90, 0.00],
        ["w", 0.00, 1.00],
        ["j", 0.05, 0.00],
    ]
    combo_action(control_service, seq, 3)


def test_combo_Shorekeeper(control_service):
    # 守岸人 BnB combo
    # seq = [
    #     # 3a 闪 az
    #     ["W_down", 0.01, 0.01],
    #     ["a", 0.05, 0.31],
    #     ["a", 0.05, 0.42],
    #     ["a", 0.05, 0.40],
    #     ["d", 0.01, 0.00],
    #     # ["E", 0.05, 0.00],
    #     ["W_up", 0.01, 0.00],
    #     ["a", 0.05, 0.30],
    #     ["z", 0.50, 0.45],
    #     # 间隔
    #     ["w", 0.00, 0.70],  # 间隔需足够，否则二段开始，角色却还在一段的后摇中，会吞按键
    #     ["j", 0.05, 1.20],
    # ]
    seq = [
        # 3a E az
        ["a", 0.05, 0.31],
        ["a", 0.05, 0.43],
        ["a", 0.05, 0.40],
        ["E", 0.05, 0.32],
        ["a", 0.05, 0.35],
        # 清空能量
        ## 常规重击
        ["z", 0.50, 0.45],
        ## E跳a
        # ["E", 0.01, 0.05],
        # ["j", 0.05, 0.05],
        # ["a", 0.05, 0.00],
        # 间隔
        ["w", 0.00, 0.70],
        ["j", 0.05, 1.20],
    ]
    combo_action(control_service, seq, 2)


def test_combo_Shorekeeper_AdvancedCombo(control_service):
    # 守岸人 BV1wjxse8EmD

    # 满能量 E跳a
    # 重击进入蝴蝶状态可普攻或E打断获得一格能量

    seq = [
        # 3a 四格能量
        ["a", 0.05, 0.31],
        ["a", 0.05, 0.43],
        ["a", 0.05, 0.40],
        # 进入蝴蝶
        ["z", 0.50, 0.30],
        # 退出蝴蝶 五格能量
        ["E", 0.01, 0.01],
        ["a", 0.01, 0.01],
        # 清空能量
        ["j", 0.05, 0.15],
        ["a", 0.05, 0.00],
        # 间隔
        ["w", 0.00, 0.55],
        # ["j", 0.05, 1.20],
        # 开大
        ["R", 0.05, 1.20],
    ]
    combo_action(control_service, seq, 2)


def test_combo_Encore(control_service):
    # 安可 BnB combo
    seq = [
        # ja
        ["j", 0.05, 0.33],
        ["a", 0.05, 0.72],
        ["j", 0.05, 1.20],

        # Ea
        ["E", 0.05, 1.90],
        ["a", 0.05, 0.90],
        ["j", 0.05, 1.20],

        # 普攻5a
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.40],
        ["a", 0.05, 0.52],
        ["a", 0.05, 0.62],
        ["a", 0.05, 1.22],
        ["j", 0.05, 1.20],

        # R
        ["R", 0.05, 2.63],
        ["j", 0.05, 1.20],

        # R E普攻E，普攻连点打满一套的时间
        ["E", 0.05, 0.28],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["a", 0.05, 0.30],
        ["E", 0.05, 0.28],
        ["w", 0.05, 1.20],
        ["j", 0.05, 1.20],
    ]
    combo_action(control_service, seq, 2)


def test_combo_verina(control_service):
    # 维里奈 BnB combo
    seq = [
        # 普攻5a
        ["a", 0.05, 0.40],
        ["a", 0.05, 0.40],
        ["a", 0.05, 0.70],
        ["a", 0.05, 0.55],
        ["a", 0.05, 0.90],
        ["j", 0.05, 1.20],

        # (切人) aa EQ 跳aaa
        ["a", 0.05, 0.35],
        ["a", 0.05, 0.32],
        ["E", 0.05, 0.10],
        ["Q", 0.05, 0.10],
        ["j", 0.05, 0.10],
        ["a", 0.05, 0.20],
        ["a", 0.05, 0.20],
        ["a", 0.05, 1.17],
        ["j", 0.05, 1.20],
    ]
    combo_action(control_service, seq, 2)


def test_combo_camellya(control_service):
    # 椿 BnB combo
    seq = [
        # 白椿 普攻4a
        ["a", 0.05, 0.29],
        ["a", 0.05, 0.46],
        ["a", 0.05, 1.00],
        ["a", 0.05, 2.00],
        ["j", 0.05, 1.20],

        # 白椿 普攻3az 转圈派生
        ["a", 0.05, 0.29],
        ["a", 0.05, 0.46],
        ["a", 0.05, 1.00],
        ["z", 3.50, 0.41],
        ["j", 0.05, 1.20],

        # 白椿 重击
        ["z", 2.50, 1.40],
        ["j", 0.05, 1.20],

        # 白椿 重击 转圈派生
        ["z", 4.78, 0.80],
        ["j", 0.05, 1.20],

        # 一日花 Ea 下砸落地
        ["E", 0.05, 1.40],
        ["a", 0.05, 1.00],
        ["j", 0.05, 1.20],

        # 白椿转红椿 普攻重击转圈 下砸落地 消耗【红椿·蕊】
        ["E", 0.05, 1.25],
        ["a", 0.05, 0.85],
        ["a", 0.05, 0.69],
        ["z", 3.55, 0.35],
        ["j", 0.05, 0.93],
        ["a", 0.05, 1.28],
        ["j", 0.05, 1.20],

        # 白椿转红椿 重击转圈 下砸落地 消耗【红椿·蕊】
        ["E", 0.05, 0.50],
        ["z", 5.35, 0.50],
        ["j", 0.05, 1.01],
        ["a", 0.05, 1.20],
        ["j", 0.05, 1.20],

        # R
        ["R", 0.05, 4.06],
        ["j", 0.05, 1.20],
    ]
    combo_action(control_service, seq, 2)


def test_combo_camellya_AdvancedCombo(control_service):
    # 椿 Advanced combo
    seq = [
        # 白椿取消转红椿 重击转圈 三连鞭
        # ["E", 0.05, 0.45],
        # ["Q", 0.05, 0.05],
        # ["d", 0.05, 0.05],
        # ["z", 5.00, 0.20],
        # ["j", 0.05, 0.55],
        # ["E", 0.05, 1.25],
        # ["j", 0.05, 1.20],

        ["E", 0.05, 0.27],
        ["Q", 0.05, 0.20],
        ["d", 0.05, 0.25],
        ["z", 5.00, 0.34],
        ["j", 0.05, 1.05],
        ["E", 0.05, 1.25],
        ["j", 0.05, 1.20],
    ]
    combo_action(control_service, seq, 2)


def test_combo_sanhua(control_service):
    # 散华 BnB combo
    seq = [
        # 普攻4a
        ["a", 0.05, 0.36],
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.60],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.89],
        ["j", 0.05, 1.20],

        # # 重击爆裂
        # ["z", 0.915, 1.30],
        # ["j", 0.05, 1.20],

        ["w", 0.00, 1.00],

        # Ez
        ["E", 0.05, 0.20],
        ["z", 0.85, 1.56],
        ["j", 0.05, 1.20],

        # 辉萤军势
        ["Q", 0.05, 0.66],
        ["a", 0.05, 0.93],
        ["a", 0.05, 1.23],
        ["j", 0.05, 1.20],

        # # 无常凶鹭
        # ["Q", 0.05, 1.45],
        # ["j", 0.05, 1.20],

        # 普攻4a
        ["a", 0.05, 0.36],
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.60],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.89],
        ["j", 0.05, 1.20],

        # ERz
        ["E", 0.05, 0.39],
        ["R", 0.05, 0.05],
        ["z", 1.85, 1.43],
        ["j", 0.05, 1.20],

        # 下落攻击
        ["j", 0.05, 0.28],
        ["a", 0.05, 0.75],
        ["j", 0.05, 1.20],

    ]
    combo_action(control_service, seq, 2)


def test_combo_cartethyia(control_service):
    # 卡提希娅 BnB combo
    seq = [
        # 小卡
        # 普攻4a 召唤神权剑
        ["a", 0.05, 0.31],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.84],
        ["a", 0.05, 1.20],
        ["j", 0.05, 1.20],

        # 重击 召唤异权剑
        ["z", 0.90, 0.60],
        ["j", 0.05, 1.20],

        # Eza
        ["E", 0.05, 0.60],
        ["z", 0.90, 0.20],
        ["a", 0.05, 1.00],
        ["j", 0.05, 1.20],

        # Ea 召唤人权剑 收剑
        ["E", 0.05, 1.00],
        ["a", 0.05, 0.92],
        ["j", 0.05, 1.20],

        # 下落攻击 收剑
        ["j", 0.05, 0.24],
        ["a", 0.05, 0.80],
        ["j", 0.05, 1.20],

        # R
        ["R", 0.05, 4.00],
        ["j", 0.05, 1.20],
        ["w", 0.00, 1.20],

        # 大卡
        # 普攻5a
        ["a", 0.05, 0.32],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.82],
        ["a", 0.05, 1.02],
        ["a", 0.05, 0.90],
        ["j", 0.05, 1.20],
        ["w", 0.00, 1.20],

        # EaaEaaa
        ["E", 0.05, 0.93],
        ["a", 0.05, 0.68],
        ["a", 0.05, 1.20],
        ["E", 0.05, 1.65],
        ["a", 0.05, 0.82],
        ["a", 0.05, 1.02],
        ["a", 0.05, 0.90],
        ["j", 0.05, 1.20],
        ["w", 0.00, 1.20],

        # R
        # ["R", 0.05, 7.20],
        ["R", 0.05, 9.40],
        ["w", 0.05, 1.20],

        ["j", 0.05, 0.80],
        ["a", 0.05, 0.61],
        ["a", 0.05, 1.20],
        ["a", 0.05, 0.61],
        ["j", 0.05, 1.20],
    ]
    combo_action(control_service, seq, 2)


def test_combo_cartethyia_AdvancedCombo(control_service):
    # 卡提希娅 advanced combo
    seq = [
        # 小卡

        # 先打一套三剑下劈

        # 普攻4a
        ["a", 0.05, 0.31],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.84],
        # ["a", 0.05, 1.20],
        ["a", 0.05, 0.70],

        ["z", 0.70, 0.50],

        ["E", 0.05, 1.00],
        ["a", 0.05, 1.10],

        # R
        ["R", 0.05, 3.60],

        # 变大卡
        # 普攻5a
        # ["a", 0.05, 0.32],
        ["a", 0.05, 0.10],
        ["a", 0.05, 0.20],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.82],
        ["a", 0.05, 1.02],
        ["a", 0.05, 0.90],

        # EaaEaaa
        ["E", 0.05, 0.93],
        ["a", 0.05, 0.68],
        ["a", 0.05, 1.20],
        # ["E", 0.05, 1.65],
        ["E", 0.05, 1.10],

        # 切小卡

        ["R", 0.05, 1.10],

        # 再打一套三剑下劈

        # 普攻4a 大卡切化身小卡从第二段普攻开始打
        # ["a", 0.05, 0.31],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.84],
        # ["a", 0.05, 1.20],
        ["a", 0.05, 0.70],

        ["z", 0.70, 0.50],

        ["E", 0.05, 1.00],
        ["a", 0.05, 1.10],

        # 切大卡
        ["R", 0.05, 0.65],

        # 普攻5a 化身卡提希娅切回芙露德莉斯从普攻第三段开始打
        # ["a", 0.05, 0.31],
        # ["a", 0.05, 0.65],
        ["a", 0.05, 0.82],
        ["a", 0.05, 1.02],
        ["a", 0.05, 0.90],

        # R
        # ["R", 0.05, 7.20],
        ["R", 0.05, 9.40],
        ["w", 0.05, 1.20],
    ]
    combo_action(control_service, seq, 2)


def test_combo_cartethyia_AdvancedCombo2(control_service):
    # 卡提希娅 advanced combo2
    # 跟1差不多，1是无剑，先打E攒剑三启动
    # 2是已有剑三，E也cd，可以变身后打E，结束后打E
    seq = [
        # 小卡
        # R
        ["R", 0.05, 3.60],

        # 切小卡
        ["w", 0.00, 0.20],
        ["R", 0.05, 1.10],

        # 再打一套三剑下劈

        # 普攻4a 大卡切化身小卡从第二段普攻开始打
        # ["a", 0.05, 0.31],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.84],
        # ["a", 0.05, 1.20],
        ["a", 0.05, 0.70],

        ["z", 0.70, 0.50],

        ["E", 0.05, 1.00],
        ["a", 0.05, 1.10],

        # 切大卡
        ["R", 0.05, 0.65],

        # 普攻5a 化身卡提希娅切回芙露德莉斯从普攻第三段开始打
        # ["a", 0.05, 0.32],
        # ["a", 0.05, 0.65],
        ["a", 0.05, 0.82],
        ["a", 0.05, 1.02],
        ["a", 0.05, 0.90],

        # EaaEaaa
        ["E", 0.05, 0.93],
        ["a", 0.05, 0.68],
        ["a", 0.05, 1.20],
        ["E", 0.05, 1.65],
        ["a", 0.05, 0.82],
        ["a", 0.05, 1.02],
        ["a", 0.05, 0.90],

        # R
        ["R", 0.05, 5.20],

        # 普攻4a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.84],
        # ["a", 0.05, 1.20],
        ["a", 0.05, 0.70],

        ["z", 0.70, 0.50],

        ["E", 0.05, 1.00],
        ["a", 0.05, 1.10],

        # 普攻4a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.84],
        # ["a", 0.05, 1.20],
        ["a", 0.05, 0.70],
        ["w", 0.00, 1.20],

        # 普攻4a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.84],
        # ["a", 0.05, 1.20],
        ["a", 0.05, 0.70],
        ["w", 0.00, 1.20],

    ]
    combo_action(control_service, seq, 2)


def test_combo_cartethyia_AdvancedCombo3(control_service):
    # 卡提希娅 快速叠剑 BV1kQN5zkEph
    # 重击松开瞬间起跳必触发下劈，要么不松要么多等一会
    seq = [
        # 小卡
        # 普攻4a
        ["a", 0.05, 0.31],
        ["a", 0.05, 0.67],
        ["a", 0.05, 0.84],
        ["a", 0.05, 1.20],
        ["j", 0.05, 1.20],

        # # zEa
        # # ["z", 0.90, 0.20],
        # ["z", 0.80, 0.00],
        # # ["a_down", 0.80, 0.00],
        # ["j", 0.05, 0.05],
        # # ["E", 0.05, 0.60],
        # ["E", 0.05, 0.10],
        # ["E", 0.05, 0.15],
        # ["d", 0.05, 0.00],
        # # ["a", 0.05, 1.00],
        # # ["a_up", 0.00, 0.10],
        # # ["a", 0.05, 0.25],
        # ["a", 0.05, 0.10],
        # ["a", 0.05, 0.10],
        # ["w", 0.00, 0.65],

        # # zEa 不松重击
        # # ["z", 0.90, 0.20],
        # ["a_down", 0.90, 0.00],
        # ["j", 0.05, 0.05],
        # # ["E", 0.05, 0.60],
        # ["E", 0.05, 0.10],
        # ["E", 0.05, 0.40],
        # ["d", 0.05, 0.00],
        # # ["a", 0.05, 1.00],
        # ["a_up", 0.00, 0.10],
        # ["a", 0.05, 0.25],
        # ["w", 0.00, 0.65],

        # zEa
        # ["z", 0.90, 0.20],
        ["z", 0.75, 0.25],
        ["j", 0.05, 0.05],
        # ["E", 0.05, 0.60],
        ["E", 0.05, 0.10],
        ["E", 0.05, 0.45],
        ["d", 0.05, 0.00],
        # ["a", 0.05, 1.00],
        ["a", 0.05, 0.10],
        ["a", 0.05, 0.10],
        ["w", 0.00, 0.65],

    ]
    combo_action(control_service, seq, 5, cycle=20)


def test_combo_ciaccona(control_service):
    # 夏空 BnB combo
    seq = [
        # 普攻4a
        ["a", 0.05, 0.24],
        ["a", 0.05, 0.88],
        ["a", 0.05, 0.85],
        ["a", 0.05, 1.30],
        ["j", 0.05, 1.20],

        # 普攻4a取消
        ["a", 0.05, 0.24],
        ["a", 0.05, 0.88],
        ["a", 0.05, 0.85],
        ["a", 0.05, 0.10],
        ["d", 0.05, 0.30],
        ["j", 0.05, 1.20],

        # E3a E后从普攻第二段开始打 E加一层风蚀
        ["E", 0.05, 0.50],
        ["a", 0.05, 0.88],
        ["a", 0.05, 0.85],
        ["a", 0.05, 1.30],
        ["j", 0.05, 1.20],

        # jaaa
        ["j", 0.05, 0.12],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.78],
        ["a", 0.05, 1.20],
        ["j", 0.05, 1.20],

        # jaaa取消
        ["j", 0.05, 0.12],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.78],
        ["a", 0.05, 0.10],
        ["d", 0.05, 1.00],
        ["j", 0.05, 1.20],

        # 3能量 重击 加一层风蚀
        ["z", 1.54, 0.20],
        ["j", 0.05, 1.20],

        # 能量不满 重击上挑
        ["z", 0.82, 0.05],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.78],
        ["a", 0.05, 1.20],
        ["j", 0.05, 1.20],

        # 空中E 3音律重击
        ["j", 0.05, 0.12],
        ["E", 0.05, 0.15],
        ["z", 1.30, 0.40],
        ["j", 0.05, 1.20],

        # R 风蚀
        ["R", 0.05, 3.67],
        # ["1", 0.05, 1.20],

        # R 光噪
        ["R", 0.05, 3.67],
        ["A", 0.05, 0.30],
        ["A", 0.05, 0.15],
        # ["1", 0.05, 1.20],

        # R 全程
        ["R", 0.05, 3.67],  # 37950
        ["w", 0.00, 34.28],
        ["j", 0.05, 1.20],

        # jaaaEaaa
        ["j", 0.05, 0.12],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.78],
        ["a", 0.05, 0.10],
        ["E", 0.05, 0.50],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.78],
        ["a", 0.05, 0.10],
        ["j", 0.05, 1.20],

        # jEaaajaaa BV1N8KyzAENt
        ["j", 0.05, 0.12],
        ["E", 0.05, 0.50],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.78],
        ["a", 0.05, 0.10],
        ["j", 0.05, 0.12],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.78],
        ["a", 0.05, 0.10],
        ["j", 0.05, 1.20],

        # 枪系通用 瞄准加特林
        ["G", 0.008, 0.008],

        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.010],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],

        ["G", 0.008, 0.008],

        ["w", 0.00, 0.50],

        # 普攻 瞄准无限戳
        ["a", 0.008, 0.200],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.200],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.200],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.200],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.200],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.200],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],
        ["a", 0.008, 0.200],
        ["G", 0.008, 0.008],
        ["G", 0.008, 0.008],

    ]
    combo_action(control_service, seq, 2)


def test_combo_phoebe(control_service):
    # 菲比 BnB combo
    seq = [
        # 强化输出
        ["z", 1.28, 0.28],
        # # 强化辅助
        # ["E", 1.28, 0.28],
        ["j", 0.05, 1.20],

        # E1
        ["E", 0.05, 0.80],
        ["j", 0.05, 1.20],

        # E2
        ["E", 0.05, 1.55],
        ["j", 0.05, 1.20],

        # 普攻3a
        ["a", 0.05, 0.28],
        ["a", 0.05, 0.51],
        ["a", 0.05, 1.10],
        ["j", 0.05, 1.20],

        # 3az
        ["a", 0.05, 0.28],
        ["a", 0.05, 0.51],
        ["a", 0.05, 0.66],
        ["z", 0.92, 0.20],
        ["j", 0.05, 1.20],

        # # R
        # ["R", 0.05, 3.63],
        # ["j", 0.05, 1.20],

    ]
    combo_action(control_service, seq, 2)


def test_combo_phoebe_AdvancedCombo(control_service):
    # 菲比 BV1GWKKeVEnm
    seq = [
        # 满buff
        ["E", 0.05, 0.05],
        ["z", 0.80, 0.00],
        ["Q", 0.05, 0.00],
        ["E", 0.05, 0.05],
        ["R", 0.05, 3.63],

        # 3az
        ["a", 0.05, 0.28],
        ["a", 0.05, 0.51],
        ["a", 0.05, 0.66],
        ["z", 0.92, 0.20],
        ["j", 0.05, 1.20],

        # 3az
        ["a", 0.05, 0.28],
        ["a", 0.05, 0.51],
        ["a", 0.05, 0.66],
        ["z", 0.92, 0.20],
        ["j", 0.05, 1.20],

        # 3az
        ["a", 0.05, 0.28],
        ["a", 0.05, 0.51],
        ["a", 0.05, 0.66],
        ["z", 0.92, 0.20],
        ["j", 0.05, 1.20],

        # 3az
        ["a", 0.05, 0.28],
        ["a", 0.05, 0.51],
        ["a", 0.05, 0.66],
        ["z", 0.92, 0.20],
        ["j", 0.05, 1.20],

    ]
    combo_action(control_service, seq, 6)


def test_combo_lynae_AdvancedCombo(control_service):
    # 琳奈
    seq = [
        # E2a
        ["E", 0.05, 0.88],
        # ["a", 0.05, 0.33],
        ["a", 0.05, 0.82],
        ["a", 0.05, 1.02],
        ["j", 0.05, 1.50],

        # 3a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.82],
        ["a", 0.05, 1.02],
        ["j", 0.05, 1.50],

        # z
        ["z", 2.26, 0.70],
        # ["j", 0.05, 1.20],

        # # 3jza
        # ["j", 0.05, 0.50],
        # ["j", 0.05, 0.50],
        # ["j", 0.05, 0.50],
        # ["z", 1.50, 0.10],
        # ["a", 0.05, 1.22],
        # ["j", 0.05, 1.20],

        # 2jzja
        ["j", 0.05, 0.50],
        ["j", 0.05, 0.50],
        ["z", 1.50, 0.10],
        ["j", 0.05, 0.50],
        ["a", 0.05, 1.22],
        ["j", 0.05, 1.20],

        # 5a
        ["a", 0.05, 0.45],
        ["a", 0.05, 0.55],
        ["a", 0.05, 0.58],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.80],  # 扔罐子
        ["w", 0.00, 0.85],  # 爆炸
        ["j", 0.05, 1.20],

        # E4a
        ["E", 0.05, 0.88],
        # ["a", 0.05, 0.45],
        ["a", 0.05, 0.55],
        ["a", 0.05, 0.58],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.80],  # 扔罐子
        ["w", 0.00, 0.85],  # 爆炸
        ["j", 0.05, 1.20],

        # R
        ["R", 0.05, 4.88],
        ["j", 0.05, 1.20],

    ]
    combo_action(control_service, seq, 6)


def test_combo_mornye_AdvancedCombo(control_service):
    # 莫宁
    seq = [
        ## 基准模式
        # # 4a
        # ["a", 0.05, 0.42],
        # ["a", 0.05, 0.70],
        # ["a", 0.05, 0.86],
        # ["a", 0.05, 1.20],
        # ["j", 0.05, 1.50],

        # # E
        # ["E", 0.05, 1.45],
        # ["j", 0.05, 1.50],

        # # 3az
        # ["a", 0.05, 0.42],
        # ["a", 0.05, 0.70],
        # ["a", 0.05, 0.30],
        # ["z", 0.80, 1.00],
        # # ["d", 0.05, 0.30],
        # ["j", 0.05, 1.80],
        # ["j", 0.05, 1.50],

        # 2aEaz
        ["a", 0.05, 0.42],
        ["a", 0.05, 0.10],
        ["E", 0.05, 0.10],
        ["a", 0.05, 0.30],
        ["z", 0.80, 1.00],
        # ["j", 0.05, 2.00],
        # ["j", 0.05, 1.50],

        # ## 广域观测模式
        # ["a", 0.05, 0.50],
        # ["a", 0.05, 0.70],
        # ["a", 0.05, 0.72],
        # ["a", 0.05, 0.86],
        #
        # ["d", 0.05, 0.30],

    ]
    combo_action(control_service, seq, 0.5, cycle=1)

    # seq = [
    #     ## 广域观测模式
    #     ["a", 0.05, 0.50],
    #     ["a", 0.05, 0.70],
    #     ["a", 0.05, 0.75],
    #     ["a", 0.05, 0.88],
    #
    #     ["A_down", 0.00, 0.00],
    #     ["d", 0.05, 0.30],
    #     ["A_up", 0.00, 0.00],
    #
    # ]
    # combo_action(control_service, seq, 1, 2)
    #
    # time.sleep(0.5)
    # seq = [
    #     ## 广域观测模式
    #     ["z", 0.50, 1.70],
    #     ["d", 0.05, 0.30],
    #     ["j", 0.05, 1.80],
    #     ["j", 0.05, 1.50],
    # ]
    # combo_action(control_service, seq, 1, 1)

    seq = [
        ## 广域观测模式
        # ["a", 0.05, 0.42],
        # ["a", 0.05, 0.78],
        # ["a", 0.05, 0.80],
        #
        # ["a", 0.05, 0.42],
        # ["a", 0.05, 0.78],
        # ["a", 0.05, 0.80],
        #
        # ["a", 0.05, 0.42],
        # ["a", 0.05, 0.70],
        # ["z", 0.50, 1.70],

        # ["z", 6.00, 1.18],
        # ["d", 0.05, 1.00],

        # ["z", 5.55, 1.50],
        ["a_down", 0.00, 0.00],
        ["w", 0.00, 5.55],
        ["a_up", 0.00, 0.00],
        ["d", 0.05, 1.00],



    ]
    combo_action(control_service, seq, 1, 1)

    seq = [
        ["j", 0.05, 2.00],
    ]
    combo_action(control_service, seq, 1, 2)


def test_combo_hiyuki_AdvancedCombo(control_service):
    # 绯雪
    seq = [
        # 常世身

        # Ea
        ["E", 0.05, 1.51],
        ["a", 0.05, 0.95],
        # ["j", 0.05, 1.50],

        # 3a
        ["a", 0.05, 0.43],
        ["a", 0.05, 0.57],
        ["a", 0.05, 1.10],
        # ["j", 0.05, 1.50],

        ["z", 1.15, 1.66],
        # ["j", 0.05, 1.50],

        # 预求身

        ["R", 0.05, 4.00],
        # ["j", 0.05, 1.50],

        # ["E", 0.05, 0.47],
        # ["E", 0.05, 1.10],
        # ["j", 0.05, 1.50],

        # 3aEE3a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.53],
        ["a", 0.05, 0.80],
        ["E", 0.05, 0.47],
        ["E", 0.05, 1.10],
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.53],
        ["a", 0.05, 1.00],
        # ["j", 0.05, 1.50],

        # adaaaz
        ["a", 0.05, 0.11],
        ["d_down", 0.00, 0.50],
        ["a", 0.05, 0.65],
        ["d_up", 0.00, 0.00],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.30],
        ["z", 0.85 + 0.35, 2.50],
        # ["j", 0.05, 1.50],

        # 5a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.53],
        ["a", 0.05, 1.00],
        ["a", 0.05, 1.03],
        ["a", 0.05, 1.30],
        # ["j", 0.05, 1.50],

        # 5a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.53],
        ["a", 0.05, 1.00],
        ["a", 0.05, 1.03],
        ["a", 0.05, 1.30],
        # ["j", 0.05, 1.50],

        # 5a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.53],
        ["a", 0.05, 1.00],
        ["a", 0.05, 1.03],
        ["a", 0.05, 1.30],
        # ["j", 0.05, 1.50],

        # adaaa
        ["a", 0.05, 0.11],
        ["d_down", 0.00, 0.50],
        ["a", 0.05, 0.65],
        ["d_up", 0.00, 0.00],
        ["a", 0.05, 0.65],
        ["a", 0.05, 0.65],
        # ["j", 0.05, 1.50],

        # 5a
        ["a", 0.05, 0.33],
        ["a", 0.05, 0.53],
        ["a", 0.05, 1.00],
        # ["a", 0.05, 1.03],
        # ["a", 0.05, 1.30],
        # ["j", 0.05, 1.50],

        ["R", 3.10, 5.15],
        ["j", 0.05, 1.50],

    ]
    try:
        combo_action(control_service, seq, 0.5, cycle=10)
    finally:
        control_service.key_up("R")
        control_service.mouse_left_up()
        control_service.mouse_right_up()


def test_combat(container, control_service):
    window_service: WindowService = container.window_service()
    img_service: ImgService = container.img_service()
    # ocr_service: OCRService = container.ocr_service()

    # img_path = file_util.get_assets_screenshot("Resonator_Shorekeeper_001.png")
    # img = img_util.read_img(img_path)
    img = img_service.screenshot()

    # resonator = Shorekeeper(control_service, img_service)
    resonator = Encore(control_service, img_service)
    resonator.energy_count(img)
    resonator.is_concerto_energy_ready(img)
    resonator.is_resonance_skill_ready(img)
    resonator.is_echo_skill_ready(img)
    resonator.is_resonance_liberation_ready(img)

    resonator.boss_hp(img)

    # for _ in range(50):
    #     shorekeeper.full_combo()
    #     time.sleep(1.5)

    # 延奏 OutroSkill
    # 变奏 IntroSkill

    # img_util.show_img(img)


def test_CombatSystem(container, control_service):
    img_service: ImgService = container.img_service()
    # 试用关卡
    combat_system = CombatSystem(control_service, img_service)
    # 单角色测试
    combat_system.resonators = [None, combat_system.lynae, None]
    # 多角色测试
    # combat_system.resonators = [combat_system.generic_resonator, combat_system.lynae, combat_system.generic_resonator]
    # 单角色时切换角色
    resonator_index = None
    empty_counter = 0
    for i in range(len(combat_system.resonators)):
        if combat_system.resonators[i]:
            resonator_index = i
            continue
        empty_counter += 1
    if empty_counter == 2 and resonator_index is not None:
        control_service.toggle_team_member(resonator_index + 1)
        time.sleep(0.15)
    # 开启挑战
    control_service.pick_up()
    combat_system.start()
